БухЭксп/InformationRegisters/ИдентификаторыПлатежныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПлатежныхСистем</Name>
			<Comment>Идентификатор</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДействияСсылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКПлатежнымСистемам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенноеПолучениеСтатуса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОперацииПлатежнойСистемы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/ИдентификаторыПлатежныхСистем/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Производит поиск идентификатора оплаты.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ отражающий операцию в информационной
//    базе.
//
// Возвращаемое значение:
//  Строка - идентификатор оплаты.
//  Неопределено - идентификатор оплаты не найден.
//
Функция ИдентификаторОплаты(ДокументОперации) Экспорт

	Результат = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОплаты КАК ИдентификаторОплаты
	|ИЗ
	|	РегистрСведений.ИдентификаторыПлатежныхСистем КАК ИдентификаторыПлатежныхСистем
	|ГДЕ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации = &ДокументОперации";
	
	Запрос.УстановитьПараметр("ДокументОперации", ДокументОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ИдентификаторОплаты;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет объектную и управляемую исключительную блокировку данных на запись документа операции.
// Перед вызовом метода необходимо открыть транзакцию.
//
// Параметры:
//  Блокировка - БлокировкаДанных - объект блокировки данных, куда необходимо добавить информацию о блокируемых данных.
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
Процедура ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации) Экспорт
	
	КлючБлокировки = СоздатьКлючЗаписи(
		Новый Структура("ДокументОперации", ДокументОперации));
	ЗаблокироватьДанныеДляРедактирования(КлючБлокировки);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИдентификаторыПлатежныхСистем");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ДокументОперации", ДокументОперации);
	
КонецПроцедуры

// Производит поиск внутреннего идентификатора заказа, если идентификатор еще не был создан, создает новый.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ отражающий операцию в информационной
//    базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  Оплата - Булево - Истина, если тип операции "Оплата", Ложь - "Возврат".
//  ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе. Передается если известен на момент
//    проведения операции.
//    Значение по умолчанию: <Пустая строка>.
//  СоздатьНовыйИдентификатор - Булево - Истина, если необходимо создать новый идентификатор игнорируя статус операции.
//  КассоваяСсылка - Строка - идентификатор (ключ) кассовой ссылки.
//
// Возвращаемое значение:
//  Строка - внутренний идентификатор операции.
//
Функция НовыйВнутреннийИдентификаторОперации(
		ДокументОперации,
		НастройкаПодключения,
		Оплата,
		ИдентификаторОплаты = "",
		СоздатьНовыйИдентификатор = Ложь,
		КассоваяСсылка = "") Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации);
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОперации.Установить(ДокументОперации);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0
			Или СоздатьНовыйИдентификатор
			Или ТребуетсяГенерацияНовогоИдентификатора(Набор[0]) Тогда
			
			Результат = Строка(Новый УникальныйИдентификатор());
			Замещать = (Набор.Количество() > 0);
			
			Набор.Очистить();
			
			Запись = Набор.Добавить();
			Запись.ДокументОперации = ДокументОперации;
			Запись.Идентификатор = Результат;
			Запись.ИдентификаторОплаты = ИдентификаторОплаты;
			Запись.Оплата = Оплата;
			Запись.НастройкаПодключения = НастройкаПодключения;
			Запись.КассоваяСсылка = КассоваяСсылка;
			
			Набор.Записать(Замещать);
			
		Иначе
			Результат = Набор[0].Идентификатор;
			
			Если Набор[0].КассоваяСсылка <> КассоваяСсылка Тогда
				
				Если ЗначениеЗаполнено(Набор[0].ИдентификаторОперации) Тогда
				
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для документа уже создана операция с другой кассовой ссылкой.
						|Новое значение: %1.
						|Сохраненное значение: %2.
						|
						|Изменение кассовой ссылки операции невозможно.
						|Отмените или удалите ранее начатую операцию.'"),
						КассоваяСсылка,
						Набор[0].КассоваяСсылка);
						
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				
				Результат = Набор[0].Идентификатор;
				Набор[0].КассоваяСсылка = КассоваяСсылка;
				Набор.Записать(Истина);
				
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Выполняет запись информации о данных операции.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//  ДанныеОперации - см. ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации
//
Процедура ЗаписатьДанныеОперации(ДокументОперации, ДанныеОперации) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации);
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОперации.Установить(ДокументОперации);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Информация о документе операции не найдена, невозможно записать данные.'");
		КонецЕсли;
		
		Запись = Набор[0];
		
		Для Каждого КлючИЗначение Из ДанныеОперации Цикл
			Если КлючИЗначение.Значение = Неопределено Тогда
				Продолжить;
			ИначеЕсли Запись[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если Запись.ОтложенноеПолучениеСтатуса
			И Не ДоступноОтложенноеПолучениеСтатуса(Запись) Тогда
			Запись.ОтложенноеПолучениеСтатуса = Ложь;
		КонецЕсли;
		
		Если Набор.Модифицированность() Тогда
			
			Набор.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При записи данных возникли ошибки:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(ТекстИсключения, Истина);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

// Выполняет установку признака загрузки статуса регламентным заданием.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе;
//  Значение - Булево - если Истина, данные статуса будут загружены регламентным заданием;
//
// Возвращаемое значение:
//  Булево - Истина, если признак отложенной загрузки статуса установлен, Ложь если операция не найдена.
//
Функция УстановитьОтложенноеПолучениеСтатуса(ДокументОперации, Значение) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИдентификаторыПлатежныхСистем");
		ЭлементБлокировки.УстановитьЗначение("ДокументОперации", ДокументОперации);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.ДокументОперации = ДокументОперации;
		Запись.Прочитать();
		
		// Если записи нет, обновление данных не имеет смысла.
		Если Не ЗначениеЗаполнено(Запись.ИдентификаторОперации) Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		// Включать отложенную загрузку имеет смысл только для операций,
		// которые не находятся в терминальном состоянии.
		Если Значение
			И Не ДоступноОтложенноеПолучениеСтатуса(Запись) Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
		
		Запись.ОтложенноеПолучениеСтатуса = Значение;
		Если Запись.ОтложенноеПолучениеСтатуса Тогда
			Запись.КоличествоПопыток = 0;
		КонецЕсли;
		
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При установке отложенного получения статуса возникли ошибки:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ТекстИсключения,
			Истина);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует данные операции по документу.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
// Возвращаемое значение:
//  Неопределено - данные операции не найдены.
//  ВыборкаИзРезультатаЗапроса:
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, через которую выполнена операция.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * ДатаЗапросаСтатуса - Дата - дата последнего запроса статуса операции.
//    * СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//    * КассоваяСсылка - Строка - идентификатор (ключ) кассовой ссылки.
//
Функция ДанныеОперации(ДокументОперации) Экспорт
	
	Выборка = ДанныеОпераций(ДокументОперации).Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Формирует данные операции по документу. В результат попадает информация только о найденных документах.
//
// Параметры:
//  ДокументыОпераций - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы,
//    Массив Из ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ или массив документов, отражающие
//    операцию в информационной базе.
//
// Возвращаемое значение:
//  РезультатЗапроса - данные операций, содержащие следующие поля:
//    * ДокументыОпераций - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, отражающий
//        операцию в информационной базе.
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСистема - ПеречислениеСсылка.ПлатежныеСервисы - платежная система, через которую выполнена операция.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * ДатаЗапросаСтатуса - Дата - дата последнего запроса статуса операции.
//    * СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//    * КассоваяСсылка - Строка - идентификатор (ключ) кассовой ссылки.
//
Функция ДанныеОпераций(ДокументыОпераций) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации КАК ДокументОперации,
	|	ИдентификаторыПлатежныхСистем.Идентификатор КАК Идентификатор,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОплаты КАК ИдентификаторОплаты,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ИдентификаторыПлатежныхСистем.СтатусОперации КАК СтатусОперации,
	|	ИдентификаторыПлатежныхСистем.ДатаОперации КАК ДатаОперации,
	|	ИдентификаторыПлатежныхСистем.СуммаОперации КАК СуммаОперации,
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения КАК НастройкаПодключения,
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения.ПлатежнаяСистема КАК ПлатежнаяСистема,
	|	ИдентификаторыПлатежныхСистем.ПлатежнаяСсылка КАК ПлатежнаяСсылка,
	|	ИдентификаторыПлатежныхСистем.ДатаДействияСсылки КАК ДатаДействияСсылки,
	|	ИдентификаторыПлатежныхСистем.ДатаЗапросаСтатуса КАК ДатаЗапросаСтатуса,
	|	ИдентификаторыПлатежныхСистем.Оплата КАК Оплата,
	|	ИдентификаторыПлатежныхСистем.СпособОплаты КАК СпособОплаты,
	|	ИдентификаторыПлатежныхСистем.КассоваяСсылка КАК КассоваяСсылка
	|ИЗ
	|	РегистрСведений.ИдентификаторыПлатежныхСистем КАК ИдентификаторыПлатежныхСистем
	|ГДЕ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации В (&ДокументыОпераций)";
	
	Запрос.УстановитьПараметр("ДокументыОпераций", ДокументыОпераций);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// См. ПлатежныеСистемы.УдалитьОперацию
//
Процедура УдалитьОперацию(ДокументОперации) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации);
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОперации.Установить(ДокументОперации);
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка удаления данных операции:
				|%1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(ТекстИсключения, Истина);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

// Определяет необходимость создания идентификатора операции или его обновления.
//
// Параметры:
//  ДанныеОперации - РегистрСведенийЗапись.ИдентификаторыПлатежныхСистем
//
// Возвращаемое значение:
//  Булево - если Истина, необходимо создать новый идентификатор.
//
Функция ТребуетсяГенерацияНовогоИдентификатора(ДанныеОперации)
	
	// Идентификатор операции необходимо обновить если выполняется одно из условий:
	//  - внутренний идентификатор операции не заполнен;
	//  - операция находится в терминальном статусе и результат по этой операции отрицательный.
	Возврат Не ЗначениеЗаполнено(ДанныеОперации.Идентификатор)
		Или ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
	
КонецФункции

// Отложенное получение статуса можно установить только для тех операций, у которых статус либо не
// заполнен, либо равен "Выполняется".
// 
// Параметры:
//  ТекущаяЗапись - РегистрСведенийЗапись.ИдентификаторыПлатежныхСистем - запись, для которой
//    необходимо выполнить проверку.
//  
// Возвращаемое значение:
//  Булево - Истина, если для операции можно установить отложенное получение статуса.
//
Функция ДоступноОтложенноеПолучениеСтатуса(ТекущаяЗапись)
	
	Возврат Не ЗначениеЗаполнено(ТекущаяЗапись.СтатусОперации)
		Или ТекущаяЗапись.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
	
КонецФункции

// Получает данные отложенных операций для дальнейшей обработки статусов.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - данные операций в разрезе участников Интернет-эквайринга:
//    * Ключ - ПеречислениеСсылка.ПлатежныеСервисы - платежная система.
//    * Значение - Массив Из Структура - данные по операциям:
//      ** ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, отражающий операцию в
//         информационной базе.
//      ** НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу - настройка,
//         по которой была выполнена операция.
//      ** ПараметрыОперации - см. ПлатежныеСистемыСлужебный.НовыйОписаниеПараметровОперации
//      ** СтатусОперации - Строка - текущий статус операции.
//      ** Оплата - Булево - Истина, если это операция оплаты.
//      ** ДатаЗапросаСтатуса - Дата - дата и время последнего запроса статуса.
//      ** КоличествоПопыток - Число - текущее количество попыток.
//      ** ДатаДействияСсылки - Дата - срок, до которого ссылка остается активной. Применимо только к
//         операции оплаты.
//
Функция ОтложенныеОперации() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации КАК ДокументОперации,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОплаты КАК ИдентификаторОплаты,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ИдентификаторыПлатежныхСистем.СтатусОперации КАК СтатусОперации,
	|	ИдентификаторыПлатежныхСистем.ДатаОперации КАК ДатаОперации,
	|	ИдентификаторыПлатежныхСистем.СуммаОперации КАК СуммаОперации,
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения КАК НастройкаПодключения,
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения.ПлатежнаяСистема КАК ПлатежнаяСистема,
	|	ИдентификаторыПлатежныхСистем.ДатаДействияСсылки КАК ДатаДействияСсылки,
	|	ИдентификаторыПлатежныхСистем.ДатаЗапросаСтатуса КАК ДатаЗапросаСтатуса,
	|	ИдентификаторыПлатежныхСистем.Оплата КАК Оплата,
	|	ИдентификаторыПлатежныхСистем.КассоваяСсылка КАК КассоваяСсылка,
	|	ИдентификаторыПлатежныхСистем.КоличествоПопыток КАК КоличествоПопыток
	|ИЗ
	|	РегистрСведений.ИдентификаторыПлатежныхСистем КАК ИдентификаторыПлатежныхСистем
	|ГДЕ
	|	ИдентификаторыПлатежныхСистем.ОтложенноеПолучениеСтатуса
	|	И ИдентификаторыПлатежныхСистем.НастройкаПодключения.Используется
	|	И СтатусОперации <> """"
	|ИТОГИ
	|ПО
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения.ПлатежнаяСистема";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПлатежнаяСистема = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПлатежнаяСистема.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаПлатежнаяСистема.ПлатежнаяСистема) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаПлатежнаяСистема.Выбрать();
		
		ДанныеОпераций = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДанныеОперации = Новый Структура;
			ДанныеОперации.Вставить("ДокументОперации", ВыборкаДетальныеЗаписи.ДокументОперации);
			ДанныеОперации.Вставить("НастройкаПодключения", ВыборкаДетальныеЗаписи.НастройкаПодключения);
			ДанныеОперации.Вставить("СтатусОперации", ВыборкаДетальныеЗаписи.СтатусОперации);
			ДанныеОперации.Вставить("Оплата", ВыборкаДетальныеЗаписи.Оплата);
			ДанныеОперации.Вставить("ДатаЗапросаСтатуса", ВыборкаДетальныеЗаписи.ДатаЗапросаСтатуса);
			ДанныеОперации.Вставить("КоличествоПопыток", ВыборкаДетальныеЗаписи.КоличествоПопыток);
			ДанныеОперации.Вставить("ДатаДействияСсылки", ВыборкаДетальныеЗаписи.ДатаДействияСсылки);
			ДанныеОперации.Вставить("КассоваяСсылка", ВыборкаДетальныеЗаписи.КассоваяСсылка);
			
			ПараметрыОперации = ПлатежныеСистемыСлужебный.НовыйОписаниеПараметровОперации();
			ЗаполнитьЗначенияСвойств(ПараметрыОперации, ВыборкаДетальныеЗаписи);

			ДанныеОперации.Вставить("ПараметрыОперации", ПараметрыОперации);
			
			ДанныеОпераций.Добавить(ДанныеОперации);
			
		КонецЦикла;
		
		Результат.Вставить(
			ВыборкаПлатежнаяСистема.ПлатежнаяСистема,
			ДанныеОпераций);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Увеличивает значение количества попыток запроса статуса.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе;
//
Процедура УвеличитьКоличествоПопытокЗапросаСтатуса(ДокументОперации) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИдентификаторыПлатежныхСистем");
		ЭлементБлокировки.УстановитьЗначение("ДокументОперации", ДокументОперации);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.ДокументОперации = ДокументОперации;
		Запись.Прочитать();
		
		Если Не ЗначениеЗаполнено(Запись.ДокументОперации) Тогда
			ВызватьИсключение НСтр("ru = 'Информация о документе операции не обнаружена, невозможно записать данные.'");
		КонецЕсли;
		
		Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
		МаксимальноеКоличествоПопыток = НастройкиПлатежныхСистемСлужебный.МаксимальноеКоличествоПопытокЗапросаСтатуса(
			НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыПлатежныеСистемы(),
			ЗначениеЗаполнено(Запись.Оплата));
		Если Запись.КоличествоПопыток > МаксимальноеКоличествоПопыток Тогда
			Запись.ОтложенноеПолучениеСтатуса = Ложь;
		КонецЕсли;
		
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При записи данных возникли ошибки:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ТекстИсключения,
			Истина);
		
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
